<a href="https://colab.research.google.com/github/rassamyjs/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/new_copy_of_113Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [1]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2020-09-02 23:04:32--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 54.231.120.226
Connecting to s3.amazonaws.com (s3.amazonaws.com)|54.231.120.226|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M  69.2MB/s    in 2.8s

2020-09-02 23:04:35 (69.2 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [2]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [3]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [4]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [6]:
##### YOUR CODE HERE #####
import pandas as pd
import numpy as np
'''product_name, product_id, user_id, order_id

In [8]:
ordered = pd.read_csv('orders.csv')
products = pd.read_csv('products.csv')
order_products__prior = pd.read_csv('order_products__prior.csv')

In [24]:
#ordered.head() 'days_since_prior_order'

In [34]:
#ordered_cut = ordered.drop(['eval_set', 'order_dow', 'order_hour_of_day'], axis=1)
#ordered_cut

In [55]:
#ordered_cut = ordered_cut.drop(['days_since_prior_order'], axis=1)
ordered_cut

         order_id  user_id  order_number
0         2539329        1             1
1         2398795        1             2
2          473747        1             3
3         2254736        1             4
4          431534        1             5
...           ...      ...           ...
3421078   2266710   206209            10
3421079   1854736   206209            11
3421080    626363   206209            12
3421081   2977660   206209            13
3421082    272231   206209            14

[3421083 rows x 3 columns]

In [79]:
ordered_cut['order_id'].nlargest(n=10,keep='first')

#ordered_cut[ordered_cut['order_number'] >=100]
condition = ordered_cut['user_id'].nlargest(n=10,keep='first')

In [ ]:
#product_id   Product name
#24852	Banana
#13176	Bag of Organic Bananas
#21137	Organic Strawberries
#21903	Organic Baby Spinach
#47209	Organic Hass Avocado
#47626	Large Lemon
#16797	Strawberries
#26209	Limes
#27845	Organic Whole Milk

In [21]:
#order_products__prior.head()

In [19]:
order_products__prior_cut = order_products__prior.drop(['add_to_cart_order', 'reordered'], axis=1)
order_products__prior_cut

          order_id  product_id
0                2       33120
1                2       28985
2                2        9327
3                2       45918
4                2       30035
...            ...         ...
32434484   3421083       39678
32434485   3421083       11352
32434486   3421083        4600
32434487   3421083       24852
32434488   3421083        5020

[32434489 rows x 2 columns]

In [202]:
order_products1 = pd.concat([order_products__prior_cut, ordered_cut])

In [20]:
#products.head()

In [190]:
product_cut = products.drop(['aisle_id', 'department_id'], axis=1)
product_cut

       product_id                                       product_name
0               1                         Chocolate Sandwich Cookies
1               2                                   All-Seasons Salt
2               3               Robust Golden Unsweetened Oolong Tea
3               4  Smart Ones Classic Favorites Mini Rigatoni Wit...
4               5                          Green Chile Anytime Sauce
...           ...                                                ...
49683       49684          Vodka, Triple Distilled, Twist of Vanilla
49684       49685                 En Croute Roast Hazelnut Cranberry
49685       49686                                   Artisan Baguette
49686       49687         Smartblend Healthy Metabolism Dry Cat Food
49687       49688                             Fresh Foaming Cleanser

[49688 rows x 2 columns]

In [180]:
product_cut[product_cut['product_name'] =='Banana']

       product_id product_name
24851       24852       Banana

In [181]:
product_cut[product_cut['product_name'] =='Bag of Organic Bananas']

       product_id            product_name
13175       13176  Bag of Organic Bananas

In [182]:
product_cut[product_cut['product_name'] =='Organic Strawberries']

       product_id          product_name
21136       21137  Organic Strawberries

In [183]:
product_cut[product_cut['product_name'] =='Organic Baby Spinach']

       product_id          product_name
21902       21903  Organic Baby Spinach

In [184]:
product_cut[product_cut['product_name'] =='Organic Hass Avocado']

       product_id          product_name
47208       47209  Organic Hass Avocado

In [185]:
product_cut[product_cut['product_name'] =='Large Lemon']

       product_id product_name
47625       47626  Large Lemon

In [186]:
product_cut[product_cut['product_name'] =='Strawberries']

       product_id  product_name
16796       16797  Strawberries

In [187]:
product_cut[product_cut['product_name'] =='Limes']

       product_id product_name
26208       26209        Limes

In [188]:
product_cut[product_cut['product_name'] =='Organic Whole Milk']

       product_id        product_name
27844       27845  Organic Whole Milk

In [37]:
#order_products = pd.concat([order_products, product_cut])
#ordered_cut[ordered_cut['order_number'] >=100]

In [43]:
#order_products

In [ ]:
#product_id   Product name
#24852	Banana
#13176	Bag of Organic Bananas
#21137	Organic Strawberries
#21903	Organic Baby Spinach
#47209	Organic Hass Avocado
#47626	Large Lemon
#16797	Strawberries
#26209	Limes
#27845	Organic Whole Milk

## Reshape Data Section

- Replicate the lesson code. Remember, if you haven't followed along typing out what we did during lecture, do that now to get more repetition with the syntax.
- Take table 2 (the transpose of table 1) and practice changing it into Tidy format and back again. You should not use the transpose operation anywhere in this code:
 - Table 2 --> Tidy
 - Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [155]:
import pandas as pd
import numpy as np
import seaborn as sns
table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T

table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [171]:
table2 = table2.reset_index()
table2

variable       index  Jane Doe  John Smith  Mary Johnson
0         treatmenta      16.0         NaN           3.0
1         treatmentb      11.0         2.0           1.0

In [162]:
# table2 -> tidy

In [172]:
tidy = pd.melt(table2, id_vars='index', value_vars=['John Smith', 'Jane Doe', 'Mary Johnson'])
tidy

        index      variable  value
0  treatmenta    John Smith    NaN
1  treatmentb    John Smith    2.0
2  treatmenta      Jane Doe   16.0
3  treatmentb      Jane Doe   11.0
4  treatmenta  Mary Johnson    3.0
5  treatmentb  Mary Johnson    1.0

In [ ]:
# tidy -> table2

In [173]:
table2 = tidy.pivot_table(index='index', columns='variable', values='value')
table2

variable    Jane Doe  John Smith  Mary Johnson
index
treatmenta      16.0         NaN           3.0
treatmentb      11.0         2.0           1.0

In [91]:
flights = sns.load_dataset('flights')

In [92]:
flights

     year      month  passengers
0    1949    January         112
1    1949   February         118
2    1949      March         132
3    1949      April         129
4    1949        May         121
..    ...        ...         ...
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

[144 rows x 3 columns]

In [ ]:
# Flights Pivot Table
#Load seaborn's flights dataset by running the cell below.
#Then create a pivot table showing the number of passengers by month and year. 
#Use year for the index and month for the columns. 
#You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [175]:
flight_pivot = flights.pivot_table(index='year', columns='month', values='passengers')
flight_pivot

month  January  February  March  April  ...  September  October  November  December
year                                    ...
1949       112       118    132    129  ...        136      119       104       118
1950       115       126    141    135  ...        158      133       114       140
1951       145       150    178    163  ...        184      162       146       166
1952       171       180    193    181  ...        209      191       172       194
1953       196       196    236    235  ...        237      211       180       201
1954       204       188    235    227  ...        259      229       203       229
1955       242       233    267    269  ...        312      274       237       278
1956       284       277    317    313  ...        355      306       271       306
1957       315       301    356    348  ...        404      347       305       336
1958       340       318    362    348  ...        404      359       310       337
1959       360       342    406    396  ...        463      407       362       405
1960       417       391    419    461  ...        508      461       390       432

[12 rows x 12 columns]

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [ ]:
##### YOUR CODE HERE #####

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [ ]:
##### YOUR CODE HERE #####